In [1]:
import pandas as pd

In [15]:
df = pd.read_csv('titanic (1).csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [16]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [18]:
target = df.Survived
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [21]:
inputs = df.drop('Survived',axis = 'columns')
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female   male
0   False   True
1    True  False
2    True  False

In [58]:
inputs = pd.concat([inputs,dummies],axis = 'columns')
inputs.head()

   Pclass   Age     Fare  female   male
0       3  22.0   7.2500   False   True
1       1  38.0  71.2833    True  False
2       3  26.0   7.9250    True  False
3       1  35.0  53.1000    True  False
4       3  35.0   8.0500   False   True

In [59]:
inputs.drop(['Sex'],axis = 'columns',inplace = True)
df.head()

KeyError: "['Sex'] not found in axis"

In [60]:
inputs.head()

   Pclass   Age     Fare  female   male
0       3  22.0   7.2500   False   True
1       1  38.0  71.2833    True  False
2       3  26.0   7.9250    True  False
3       1  35.0  53.1000    True  False
4       3  35.0   8.0500   False   True

In [61]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [62]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [66]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(7)

   Pclass        Age     Fare  female   male
0       3  22.000000   7.2500   False   True
1       1  38.000000  71.2833    True  False
2       3  26.000000   7.9250    True  False
3       1  35.000000  53.1000    True  False
4       3  35.000000   8.0500   False   True
5       3  29.699118   8.4583   False   True
6       1  54.000000  51.8625   False   True

In [68]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size = 0.2)

In [69]:
len(X_train)

712

In [71]:
len(X_test)

179

In [77]:
len(inputs)

891

In [78]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

model.fit(X_train,y_train)

In [80]:
model.score(X_test,y_test)

0.7932960893854749

In [82]:
X_test[:10]

     Pclass        Age      Fare  female   male
613       3  29.699118    7.7500   False   True
884       3  25.000000    7.0500   False   True
127       3  24.000000    7.1417   False   True
890       3  32.000000    7.7500   False   True
22        3  15.000000    8.0292    True  False
603       3  44.000000    8.0500   False   True
660       1  50.000000  133.6500   False   True
118       1  24.000000  247.5208   False   True
531       3  29.699118    7.2292   False   True
477       3  29.000000    7.0458   False   True

In [84]:
y_test[:10]

613    0
884    0
127    1
890    0
22     1
603    0
660    1
118    0
531    0
477    0
Name: Survived, dtype: int64

In [86]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 1, 0, 1, 1, 0, 0], dtype=int64)

In [87]:
model.predict_proba(X_test[:10])

array([[9.91097055e-01, 8.90294475e-03],
       [9.90781883e-01, 9.21811670e-03],
       [9.90698240e-01, 9.30176019e-03],
       [9.91166564e-01, 8.83343630e-03],
       [7.67083206e-02, 9.23291679e-01],
       [9.90808521e-01, 9.19147938e-03],
       [5.60898476e-02, 9.43910152e-01],
       [3.27741615e-08, 9.99999967e-01],
       [9.91076788e-01, 8.92321217e-03],
       [9.91038979e-01, 8.96102123e-03]])